[Stormrider X2SoldierClassTemplate]
+DisplayName="Stormrider"
+ClassSummary="Stormriders are fearsome melee combatants. They posses rage-fueled psionic powers that manifest as red lightning. They can break through toughest defense and form an impenetrable wall, all while effortlessly and graciously zapping around the battlefield."
+LeftAbilityTreeTitle="Berserker"
+RightAbilityTreeTitle="Charger"
AbilityTreeTitles[0]="Berserker"
AbilityTreeTitles[1]="Charger"
AbilityTreeTitles[2]="Stalwart"
AbilityTreeTitles[3]="Breaker"

+RandomNickNames[0]="Slayer"
+RandomNickNames[1]="Lumberjack"
+RandomNickNames[2]="Gladiator"
+RandomNickNames[3]="Shatterer"
+RandomNickNames[4]="Spaniard"
+RandomNickNames[5]="Wrecker"
+RandomNickNames[6]="Ragnarok"
+RandomNickNames[7]="Havoc"
+RandomNickNames[8]="Ardent"
+RandomNickNames[9]="Fortress"
+RandomNickNames[10]="Devastator"
+RandomNickNames[11]="Proximo"
+RandomNickNames[12]="Claymore"
+RandomNickNames[13]="Raven"
+RandomNickNames[14]="Interceptor"
+RandomNickNames[15]="Raiden"
+RandomNickNames[16]="Hellion"
+RandomNickNames[17]="Swordsinger"
+RandomNickNames[18]="Defiant"
+RandomNickNames[19]="Shockblast"
+RandomNickNames[20]="Weissheim"
+RandomNickNames[21]="Razor"
+RandomNickNames[22]="Blitz"
+RandomNickNames[23]="Crackle"
+RandomNickNames[24]="Crimson"
+RandomNickNames[25]="Redrumm"
+RandomNickNames[26]="Shockerface"

RandomNickNames_Male[0]="Thor"
RandomNickNames_Male[1]="Thunderlord"
RandomNickNames_Male[2]="Axeman"
RandomNickNames_Male[3]="Magnus"


RandomNickNames_Female[0]="Valkyrie"
RandomNickNames_Female[1]="Scarlett"
RandomNickNames_Female[2]="Queenblade"
RandomNickNames_Female[3]="Shieldmaiden"

;	=================================================
;				SQUADDIE ABILITIES
;	=================================================

[IRI_Rider_BonusAim X2AbilityTemplate]
LocFriendlyName="Edge Alignment"
LocLongDescription="Your melee attacks gain <Ability:EDGE_ALIGNMENT_BONUS_AIM/> Aim."
LocHelpText="Your melee attacks gain <Ability:EDGE_ALIGNMENT_BONUS_AIM/> Aim."

[IRI_Windcaller_Passive X2AbilityTemplate]
LocFriendlyName="Windcaller's Legacy"
LocLongDescription="Melee attacks against targets on an adjacent tile cost 1 AP and do not end the turn. Attacking an enemy within blue move range grants a Move-only action. If using <font color='#0bff9b'>\"Empty\"</font> secondary weapon, the Move action is granted for all melee attacks."
LocHelpText="Gain Move-only AP after attacking in melee."
LocPromotionPopupText="\"Within blue move\" means that player is literally able to see the blue border. If the blue border is not visible just before the attack is activated, then Windcaller's Legacy will not activate."
LocFlyOverText="Windcaller's Legacy" 

[IRI_Rider_Intercept X2AbilityTemplate]
LocFriendlyName="Intercept"
LocLongDescription="Melee attack the first enemy that moves within your line of sight and <Ability:INTERCEPT_ACTION_POINT_DISTANCE/> AP move distance with a penalty to aim."
LocHelpText="Melee attack the first enemy that moves within your line of sight and <Ability:INTERCEPT_ACTION_POINT_DISTANCE/> AP move distance with a penalty to aim."
LocFriendlyNameWhenConcealed="Intercept (Concealed)"
LocLongDescriptionWhenConcealed="Melee attack the first enemy that moves within your line of sight and <Ability:INTERCEPT_ACTION_POINT_DISTANCE/> AP move distance but only if revealed."
LocPromotionPopupText="<Bullet/> Intercept must be used carefully, as the intercepting soldier can attract unwanted attention from other enemies.<br/><Bullet/> Intercept is not triggered by attacks, only movement, unless the soldier has <font color='#0bff9b'>Covering Fire</font>.<br/><Bullet/> Targets immune to Overwatch and other reaction fire cannot be Intercepted. <br/><Bullet/> Interception attack suffers reaction fire penalties and normally cannot deal critical damage, unless activated while Concealed. <br/><Bullet/> Intercept is allowed to break concealment in order to attack the moving enemy: <Ability:INTERCEPT_ALLOW_TO_BREAK_CONCEALMENT/><br/><Bullet/> After Interception, the soldier will return to their original position: <Ability:INTERCEPT_RETURN_TO_ORIGINAL_TILE/><br/><Bullet/> The return move is not 100% guaranteed.<br/><Bullet/> Intercept can benefit from <font color='#0bff9b'>Guardian</font>."
LocFlyOverText="Intercept"

[IRI_Rider_Intercept_Attack X2AbilityTemplate]
LocFriendlyName="Intercept"
LocLongDescription="Melee attack the first enemy that moves within your line of sight and <Ability:INTERCEPT_ACTION_POINT_DISTANCE/> AP move distance with a penalty to aim."
LocHelpText="Melee attack the first enemy that moves within your line of sight and <Ability:INTERCEPT_ACTION_POINT_DISTANCE/> AP move distance with a penalty to aim."
LocFriendlyNameWhenConcealed="Intercept (Concealed)"
LocLongDescriptionWhenConcealed="Melee attack the first enemy that moves within your line of sight and <Ability:INTERCEPT_ACTION_POINT_DISTANCE/> AP move distance but only if revealed."
LocFlyOverText="Intercept"

;	=================================================
;				BERSERKER TREE
;	=================================================

[IRI_Rider_PowerUp X2AbilityTemplate]
LocFriendlyName="Power Up"
LocLongDescription="Activate to boost the damage of the next mainhand melee attack by <Ability:POWER_UP_DAMAGE_MULTIPLIER/>, gain knockback immunity and become able to break away if bound by a Viper. Can be activated with Move-only actions."
LocHelpText="Activate to boost the damage of the next mainhand melee attack by <Ability:POWER_UP_DAMAGE_MULTIPLIER/>, gain Knockback immunity and become able to break away if bound by a Viper."
LocLongDescriptionWhenConcealed="Activate to boost the damage of the next mainhand melee attack by <Ability:POWER_UP_DAMAGE_MULTIPLIER/>, gain Knockback immunity and become able to break away if bound by a Viper. Does not break concealment."
LocPromotionPopupText="<Bullet/> The unit has Knockback immunity and can break away if bound by a Viper only while the Power Up effect is active. <br/><Bullet/> Power Up effect lasts indefinitely, but it will be removed after one attack or one breakaway.<br/><Bullet/> Breakaway happens on your turn after the unit has been bound, so they still take initial damage from the Bind.<br/><Bullet/> <Ability:POWER_UP_COOLDOWN/> turns cooldown."
LocFlyOverText="Bind broken!"

[IRI_Rider_Enrage X2AbilityTemplate]
LocFriendlyName="Enrage"
LocLongDescription="Become Enraged for <Ability:ENRAGE_DURATION_TURNS/> turns, dealing <Ability:ENRAGE_DAMAGE_MULTIPLIER/> more melee damage and becoming immune to mental effects, but suffering a <Ability:ENRAGE_DEFENSE_PENALTY/> Defense penalty.<Ability:ENRAGE_COOLDOWN/> turn cooldown that is reduced each time this unit attacks or is targeted by enemy attacks."
LocHelpText="Become Enraged, dealing <Ability:ENRAGE_DAMAGE_MULTIPLIER/> more melee damage and becoming immune to mental effects, but suffering a <Ability:ENRAGE_DEFENSE_PENALTY/> Defense penalty."
LocFlyOverText="Enraged!" 
LocPromotionPopupText="<Bullet/> Using Overdrive Serum will Enrage the soldier as well, irrespective of the cooldown."

[IRI_Rider_Enrage_Passive X2AbilityTemplate]
LocFriendlyName="Endless Rage"
LocLongDescription="When this unit attacks or is being targeted by enemy abilities, Enrage cooldown is reduced by 1 turn."
LocHelpText="When this unit attacks or is being targeted by enemy abilities, Enrage cooldown is reduced by 1 turn."

[IRI_Rider_CullTheWeak X2AbilityTemplate]
LocFriendlyName="Cull The Weak"
LocLongDescription="Gain <Ability:CULL_THE_WEAK_BONUS_CRIT_PER_MISSING_PERCENT_HP/> Crit Chance for every 1% of HP the target is missing."
LocHelpText="Gain <Ability:CULL_THE_WEAK_BONUS_CRIT_PER_MISSING_PERCENT_HP/> Crit Chance for every 1% of HP the target is missing."
LocFlyOverText="" 

[IRI_Rider_Gore X2AbilityTemplate]
LocFriendlyName="Gore"
LocLongDescription="Killing an enemy has a chance to panic some of the nearby organic enemies."
LocHelpText="Killing an enemy has a chance to panic some of the nearby organic enemies."
LocPromotionPopupText="<Bullet/> Gore activates every time the unit kills an enemy, and then the chance to panic is rolled for every enemy individually. Cooldown: <Ability:GORE_COOLDOWN/> turns.<br/><Bullet/> Only organic enemies who had direct line of sight to the killed enemy can panic.<br/><Bullet/> Panic is removed if the soldier that caused the panic is killed.<br/><Bullet/> Panic chance = Rank * <Ability:GORE_PANIC_CHANCE_PER_RANK/> + Damage * <Ability:GORE_PANIC_CHANCE_PER_POINT_OF_DAMAGE/> + Max HP * <Ability:GORE_PANIC_CHANCE_PER_POINT_OF_MAX_HP/> - Enemy Will, where:<br/>Rank = Soldier's Rank, counting Squaddie as Rank 1.<br/>Damage = total damage dealt by the soldier to the killed enemy.<br/>Max HP = maximum HP of the killed enemy.<br/>Enemy Will - will of the enemy that can panic."
LocFlyOverText="Gore" 

[IRI_Rider_Gore_Passive X2AbilityTemplate]
LocFriendlyName="Gore"
LocLongDescription="Killing an enemy has a chance to panic some of the nearby organic enemies."
LocHelpText="Killing an enemy has a chance to panic some of the nearby organic enemies."
LocFlyOverText="Gore" 

[IRI_Rider_Obsession X2AbilityTemplate]
LocFriendlyName="Obsession"
LocFriendlyNameWhenConcealed="Obsession (Break Concealment)"
LocLongDescriptionWhenConcealed="Immediately break concealment and mark an enemy. Until the start of your next turn, attack the enemy for every action they take."
LocLongDescription="Mark an enemy. Until the start of your next turn, attack the enemy for every action they take."
LocHelpText="Mark an enemy. Until the start of your next turn, attack the enemy for every action they take."
LocPromotionPopupText="<Bullet/> Any action will trigger an Obsession attack, but another attack will be possible only after the target activates an ability that costs at least one Action Point.<br/><Bullet/> Obsessed unit will follow the target around, quite likely leaving the unit outside of cover, so it must be used with caution.<br/><Bullet/> Obsession attacks are preemptive when possible, meaning that most of the time they will come before the enemy action that activated them.<br/><Bullet/> Obsession attacks count as reaction attacks and suffer aim penalties.<br/><Bullet/> Obsession allows reaction attacks to deal critical damage to the target: <Ability:OBSESSION_ALLOWS_REACTION_FIRE_CRIT/><br/><Bullet/> If the obsessed unit has <font color='#ff3206'>Riposte</font>, they will automatically counter all target's attacks directed at them, if possible.<br/><Bullet/> If Obsession is used while Concealed, the concealment will be broken immediately.<br/><Bullet/> The obsessing unit is able to attack the target only if it can be reached with <Ability:OBSESSION_ACTION_POINT_DISTANCE/> AP of movement. If the enemy is able to teleport or otherwise possesses superior mobility, they may be able to escape the obsessed unit.<br/><Bullet/> Cooldown: <Ability:OBSESSION_COOLDOWN/> turn(s).<br/><Bullet/> This ability benefits from the <Ability:GHOST_RIDER_INTERCEPT_MOBILITY_BONUS/> Mobility bonus provided by <font color='#ff3206'>Ghost Rider</font>" 
LocFlyOverText="Obsessed!" 

[IRI_Rider_Bloodlust X2AbilityTemplate]
LocFriendlyName="Bloodlust"
LocLongDescription="Activate to make kills grant <Ability:BLOODLUST_STACKS_PER_KILL/> Bloodlust stack(s), maximum <Ability:BLOODLUST_MAXIMUM_STACKS/> stacks. Each stack will increase melee damage by <Ability:BLOODLUST_BONUS_DAMAGE_PER_STACK/>. At <Ability:BLOODLUST_UNLEASH_AVAILABLE_STACKS/> stacks gain access to a powerful <font color='#ff3206'>Unleash</font> attack that deals high electrical damage in a specified area."
LocHelpText="Melee kills increase melee damage by <Ability:BLOODLUST_BONUS_DAMAGE_PER_KILL/>. Stacks up to <Ability:BLOODLUST_MAXIMUM_STACKS/> times. Consume <Ability:CASTING_UNLEASH_CONSUMES_STACKS/> stack(s) to unleash a powerful area attack."
LocFlyOverText="Bloodlust" 
LocPromotionPopupText="<Bullet/> Bloodlust lasts <Ability:BLOODLUST_DURATION_TURNS/> turn(s). 0 means infinite duration.<br/><Bullet/> Bloodlust ends if there are no enemies in the soldier's line of sight: <Ability:BLOODLUST_EFFECT_IS_REMOVED_IF_NO_ENEMIES/><br/><Bullet/> <Ability:BLOODLUST_COOLDOWN/> turn cooldown. Cooldown starts when the Bloodlust ends. <br/><Bullet/> <font color='#ff3206'>Unleash</font> deals <Ability:UNLEASH_BASEDAMAGE_MIN/> - <Ability:UNLEASH_BASEDAMAGE_MAX/> electrical damage that ignores armor, and <Ability:UNLEASH_ENVIRONMENTAL_DAMAGE/> environmental damage. Bloodlust stacks do not increase its damage.<br/><Bullet/> <font color='#ff3206'>Unleash</font> is a turn-ending ability that costs at least one standard Action Point.<br/><Bullet/> <font color='#ff3206'>Unleash</font> has a <Ability:UNLEASH_RADIUS_METERS/> meter radius. One meter is roughly equal to one tile.<br/><Bullet/> <font color='#ff3206'>Unleash</font> becomes available when <Ability:BLOODLUST_UNLEASH_AVAILABLE_STACKS/> stacks are accumulated, and it will consume <Ability:CASTING_UNLEASH_CONSUMES_STACKS/> stacks when used.<br/><Bullet/> <font color='#ff3206'>Unleash</font> will end the Bloodlust when activated: <Ability:CASTING_UNLEASH_REMOVES_BLOODLUST_EFFECT/>.<br/><Bullet/> This ability is affected by <font color='#ff3206'>Windcaller's Legacy</font> as if it was a melee attack."

[IRI_Rider_Bloodlust_Charge X2AbilityTemplate]
LocFriendlyName="Bloodlust"
LocLongDescription="Activate to make kills grant <Ability:BLOODLUST_STACKS_PER_KILL/> Bloodlust stack(s), maximum <Ability:BLOODLUST_MAXIMUM_STACKS/> stacks. Each stack will increase melee damage by <Ability:BLOODLUST_BONUS_DAMAGE_PER_STACK/>. At <Ability:BLOODLUST_UNLEASH_AVAILABLE_STACKS/> stacks gain access to a powerful <font color='#ff3206'>Unleash</font> attack that deals high electrical damage in a specified area."
LocHelpText="Melee kills increase melee damage by <Ability:BLOODLUST_BONUS_DAMAGE_PER_KILL/>. Stacks up to <Ability:BLOODLUST_MAXIMUM_STACKS/> times. Consume <Ability:CASTING_UNLEASH_CONSUMES_STACKS/> stack(s) to unleash a powerful area attack."
LocFlyOverText="Unleash is available!" 

[IRI_Rider_Bloodlust_Charge_PreMax X2AbilityTemplate]
LocFriendlyName="Bloodlust"
LocLongDescription="Activate to make kills grant <Ability:BLOODLUST_STACKS_PER_KILL/> Bloodlust stack(s), maximum <Ability:BLOODLUST_MAXIMUM_STACKS/> stacks. Each stack will increase melee damage by <Ability:BLOODLUST_BONUS_DAMAGE_PER_STACK/>. At <Ability:BLOODLUST_UNLEASH_AVAILABLE_STACKS/> stacks gain access to a powerful <font color='#ff3206'>Unleash</font> attack that deals high electrical damage in a specified area."
LocHelpText="Melee kills increase melee damage by <Ability:BLOODLUST_BONUS_DAMAGE_PER_KILL/>. Stacks up to <Ability:BLOODLUST_MAXIMUM_STACKS/> times. Consume <Ability:CASTING_UNLEASH_CONSUMES_STACKS/> stack(s) to unleash a powerful area attack."
LocFlyOverText="Bloodlust grows..." 

[IRI_Rider_Bloodlust_Remove X2AbilityTemplate]
LocFriendlyName="Bloodlust Removed"
LocLongDescription="Bloodlust Removed"
LocHelpText="Bloodlust Removed"
LocFlyOverText="Bloodlust ended" 

[IRI_Rider_Unleash X2AbilityTemplate]
LocFriendlyName="Unleash"
LocLongDescription="Discharge <Ability:CASTING_UNLEASH_CONSUMES_STACKS/> Bloodlust stacks in a powerful area attack, dealing electrical damage that bypasses armor."
LocHelpText="Discharge <Ability:CASTING_UNLEASH_CONSUMES_STACKS/> stacks in a powerful area attack, dealing electrical damage that bypasses armor"
LocFlyOverText="Unleash" 

[IRI_Rider_BerserkerRage X2AbilityTemplate]
LocFriendlyName="Eye of the Storm"
LocLongDescription="If mentally impaired at the start of your turn, cleanse any mental impairments and become Enraged. Does not work when mindcontrolled. 5 turn cooldown."
LocHelpText="If mentally impaired at the start of your turn, cleanse any mental impairments and become Enraged. Does not work when mindcontrolled."
LocFlyOverText="Enraged!" 

[IRI_Rider_BerserkerRage_Passive X2AbilityTemplate]
LocFriendlyName="Eye of the Storm"
LocLongDescription="If mentally impaired at the start of your turn, cleanse any mental impairments and become Enraged. Does not work when mindcontrolled. <Ability:BERSERKER_RAGE_COOLDOWN/> turn cooldown."
LocHelpText="If mentally impaired at the start of your turn, cleanse any mental impairments and become Enraged. Does not work when mindcontrolled."
LocFlyOverText="Enraged!" 


;	=================================================
;				CHARGER TREE
;	=================================================

[IRI_Rider_PowerKick X2AbilityTemplate]
LocFriendlyName="Blitz Kick"
LocLongDescription="Kick an enemy, dealing damage that scales with soldier's rank. This ability can be used only with Move actions."
LocHelpText="Kick an enemy, dealing damage that scales with soldier's rank. This ability can be used only with Move actions."
LocFlyOverText="Blitz Kick" 
LocPromotionPopupText="<Bullet/> Blitz Kick deals <Ability:POWER_KICK_BASEDAMAGE_MIN/> - <Ability:POWER_KICK_BASEDAMAGE_MAX/> base damage (+<Ability:POWER_KICK_BASEDAMAGE_CRIT/> Crit), and gains additional <Ability:POWER_KICK_BONUS_DAMAGE_PER_RANK/> for each soldier rank. Corporal counts as Rank 2.<br/><Bullet/> This ability does not gain any bonuses from equipped weapons. <br/><Bullet/> Blitz Kick has innate bonuses of <Ability:POWER_KICK_AIM_BONUS/> Aim and <Ability:POWER_KICK_CRIT_BONUS/> Crit."

[IRI_Rider_Teleport X2AbilityTemplate]
LocFriendlyName="Conduit"
LocLongDescription="Teleport to an allied soldier. Consumes all action points and grants one Move-only action. Breaks concealment. Allows the soldier to teleport to the original tile after using <font color='#ff3206'>Intercept</font>."
LocHelpText="Teleport to an allied soldier and gain a Move action."
LocFriendlyNameWhenConcealed="Conduit (Break Concealment)"
LocLongDescriptionWhenConcealed="Break concealment, teleport to an allied soldier and gain a Move action."
LocFlyOverText="Conduit" 
LocPromotionPopupText="<Bullet/> <Ability:CONDUIT_COOLDOWN/> turn cooldown.<br/><Bullet/> This ability requires at least one Standard or Move Action Point to activate. <br/><Bullet/> Conduit is more effective when used to teleport to a bondmate. Teleporting to a bondmate doesn't require line of sight, and at bond level <Ability:CONDUIT_BONDMATE_RANK_REQUIRED_FOR_SHIELD/> will grant them a protective shield that absorbs <Ability:CONDUIT_BONDMATE_SHIELD_HP/> damage and lasts <Ability:CONDUIT_BONDMATE_SHIELD_DURATION/> turns, counting the turn the Conduit was used. <br/><Bullet/> It's not possible to teleport to a soldier that's dead, mindcontrolled or bleeding out."

[IRI_Rider_InterceptionReturnTeleport X2AbilityTemplate]
LocFriendlyName="Conduit"
LocLongDescription="Teleport to the original tile after performing <font color='#ff3206'>Interception</font>."
LocHelpText="Teleport to the original tile after performing <font color='#ff3206'>Interception</font>."
LocFlyOverText="Conduit" 

[IRI_Rider_ConcussiveBlows X2AbilityTemplate]
LocFriendlyName="Concussive Blows"
LocLongDescription="Your melee critical hits Disorient. Critical hits against disoriented enemies Stun. Melee attacks against stunned enemies deal <Ability:CONCUSSIVE_BLOWS_BONUS_DAMAGE_VS_STUNNED/> more damage. Gain <Ability:CONCUSSIVE_BLOWS_BONUS_CRIT_CHANCE/> melee crit chance."
LocHelpText="Your melee critical hits Disorient. Critical hits against disoriented enemies Stun. Melee attacks against stunned enemies deal <Ability:CONCUSSIVE_BLOWS_BONUS_DAMAGE_VS_STUNNED/> more damage. Gain <Ability:CONCUSSIVE_BLOWS_BONUS_CRIT_CHANCE/> melee crit chance."
LocFlyOverText="Concussive Blows"
LocPromotionPopupText="<Bullet/> Affects only Melee attacks.<br/><Bullet/> Disorient chance: <Ability:CONCUSSIVE_BLOWS_DISORIENT_CHANCE/>, duration: <Ability:CONCUSSIVE_BLOWS_DISORIENT_TURNS/> turns.<br/><Bullet/> Stun chance: <Ability:CONCUSSIVE_BLOWS_STUN_CHANCE/>, stun lasts for <Ability:CONCUSSIVE_BLOWS_STUN_ACTIONS/> actions. <br/><Bullet/> Disorientation and Stun from Concussive Blows require a critical hit: <Ability:CONCUSSIVE_BLOWS_REQUIRE_CRIT_STRIKE/>"

[IRI_Rider_ConcussiveBlows_Passive X2AbilityTemplate]
LocFriendlyName="Concussive Blows"
LocLongDescription="Your melee critical hits Disorient. Critical hits against disoriented enemies Stun. Melee attacks against stunned enemies deal <Ability:CONCUSSIVE_BLOWS_BONUS_DAMAGE_VS_STUNNED/> more damage. Gain <Ability:CONCUSSIVE_BLOWS_BONUS_CRIT_CHANCE/> melee crit chance."
LocHelpText="Your melee critical hits Disorient. Critical hits against disoriented enemies Stun. Melee attacks against stunned enemies deal <Ability:CONCUSSIVE_BLOWS_BONUS_DAMAGE_VS_STUNNED/> more damage. Gain <Ability:CONCUSSIVE_BLOWS_BONUS_CRIT_CHANCE/> melee crit chance."
LocFlyOverText="Concussive Blows"

[IRI_Rider_Respite X2AbilityTemplate]
LocFriendlyName="Recharge"
LocFriendlyNameWhenConcealed="Recharge (Break Concealment)"
LocLongDescriptionWhenConcealed="Break concealment and recover <Ability:RECHARGE_RESTORE_MISSING_HP_PERCENT/> of missing HP, <Ability:RECHARGE_RESTORE_MISSING_WILL_PERCENT/> of missing Will, <Ability:RECHARGE_RESTORE_MISSING_ARMOR_PERCENT/> of Shredded Armor and <Ability:RECHARGE_RESTORE_MISSING_SHIELD_PERCENT/> of missing <font color='#0bff9b'>Ballistic Shield</font> HP, if equipped."
LocLongDescription="Recover <Ability:RECHARGE_RESTORE_MISSING_HP_PERCENT/> of missing HP, <Ability:RECHARGE_RESTORE_MISSING_WILL_PERCENT/> of missing Will, <Ability:RECHARGE_RESTORE_MISSING_ARMOR_PERCENT/> of Shredded Armor and <Ability:RECHARGE_RESTORE_MISSING_SHIELD_PERCENT/> of missing <font color='#0bff9b'>Ballistic Shield</font> HP, if equipped."
LocHelpText="Recover <Ability:RECHARGE_RESTORE_MISSING_HP_PERCENT/> of missing HP, <Ability:RECHARGE_RESTORE_MISSING_WILL_PERCENT/> of missing Will, <Ability:RECHARGE_RESTORE_MISSING_ARMOR_PERCENT/> of Shredded Armor and <Ability:RECHARGE_RESTORE_MISSING_SHIELD_PERCENT/> of missing <font color='#0bff9b'>Ballistic Shield</font> HP, if equipped."
LocPromotionPopupText="<Bullet/> All numbers are rounded up.<br/><bullet/> Breaks concealment when used.<br/><bullet/> <Ability:RECHARGE_COOLDOWN/> turn cooldown. <br/><bullet/> <Ability:RECHARGE_CHARGES/> use(s) per mission (0 means infinite uses). <br/><bullet/> Recharge is a free action: <Ability:FREE_ACTION/>.<br/><bullet/> Recharge ends soldier's turn: <Ability:RECHARGE_ENDS_TURN/>."
LocFlyOverText="Recharge"

[IRI_Rider_CrossStrike X2AbilityTemplate]
LocFriendlyName="Cross Strike"
LocLongDescription="Critical Strikes from standard melee attacks cause an additional attack instead of dealing bonus critical damage. Passively gain <Ability:CROSS_STRIKE_BONUS_CRIT/> melee crit chance."
LocHelpText="Critical Strikes from standard melee attacks cause an additional attack instead of dealing bonus critical damage. Passively gain <Ability:CROSS_STRIKE_BONUS_CRIT/> melee crit chance."
LocFlyOverText="Cross Strike" 
LocPromotionPopupText="<Bullet/> This ability does not affect abilities that do not rely on a melee weapon, such as Blitz Kick.<br/><Bullet/> The original attack still counts as a Crit. Additional strikes always hit, but never crit. <br/><Bullet/> Works with Dual Wielding. If the primary sword slash crits, the target will receive 4 attacks in total, two from each weapon.<br/><Bullet/> Critical hits from <font color='#ff3206'>Obsession</font> attacks can become Cross Strikes."

[IRI_Rider_CrossStrike_Attack X2AbilityTemplate]
LocFriendlyName="Cross Strike"
LocLongDescription="Critical Strikes from standard melee attacks cause an additional strike instead of applying critical damage."
LocHelpText="Critical Strikes from standard melee attacks cause an additional strike instead of applying critical damage."
LocFlyOverText="Cross Strike" 

[IRI_WindcallerFury X2AbilityTemplate]
LocFriendlyName="Windcaller's Fury"
LocLongDescription="Melee attacks always cost 1 Action Point and do not end turn."
LocHelpText="Melee attacks always cost 1 Action Point and do not end turn."
LocFlyOverText="Windcaller's Fury"

[IRI_Rider_MartialArts X2AbilityTemplate]
LocFriendlyName="Martial Arts"
LocLongDescription="Deal <Ability:MARTIAL_ARTS_BONUS_DAMAGE/> melee damage to humanoid enemies and with melee attacks that don't require a weapon."
LocHelpText="Deal <Ability:MARTIAL_ARTS_BONUS_DAMAGE/> melee damage to humanoid enemies and with melee attacks that don't require a weapon."
;LocFlyOverText="Martial Arts" 

;	=================================================
;				STALWART TREE
;	=================================================

[IRI_Rider_Guard X2AbilityTemplate]
LocFriendlyName="Guard"
LocLongDescription="Activate to Guard the next incoming attack, reducing its effectiveness. Can be used multiple times to Guard against multiple attacks. Can be used with Move-only actions. When carrying a <font color='#0bff9b'>Ballistic Shield</font>, used automatically if the soldier didn't attack this turn."
LocHelpText="Guard against the next incoming attack, reducing its effectiveness."
LocPromotionPopupText="<Bullet/> Guard reduces the effectiveness of enemy attacks by downgrading their result: if an attack would Crit, it will be downgraded to a regular Hit. Hits are downgraded to Grazes, and Grazes (Dodges) will not hit the soldier at all.<br/><Bullet/> When equipped with a <font color='#0bff9b'>Ballistic Shield</font>, the attack is downgraded twice: Crits become Grazes, and regular Hits and Grazes are Deflected. <br/><Bullet/> Guard will also reduce explosive damage by <Ability:GUARD_EXPLOSIVE_DAMAGE_MULTIPLIER/> at the cost of one charge."
LocFlyOverText="Guard: " 

[IRI_Rider_Aegis X2AbilityTemplate]
LocFriendlyName="Aegis"
LocLongDescription="Shield Wall now reduces incoming damage by <Ability:AEGIS_DAMAGE_REDUCTION/> and redirects any attacks against nearby allies towards you."
LocHelpText="Shield Wall now reduces incoming damage by <Ability:AEGIS_DAMAGE_REDUCTION/> and redirects any attacks against nearby allies towards you."
LocPromotionPopupText="<Bullet/> Affects Shield Wall granted by <font color='#0bff9b'>Ballistic Shields</font> and <font color='#0bff9b'>W.A.R. Suits</font>.<br/><Bullet/> Aegis affects allies on directly neighboring tiles. Allies on diagonal tiles are not affected."
LocFlyOverText="Aegis"

[IRI_Rider_Aegis_Passive X2AbilityTemplate]
LocFriendlyName="Aegis"
LocLongDescription="Shield Wall now reduces incoming damage by <Ability:AEGIS_DAMAGE_REDUCTION/> and redirects any attacks against nearby allies towards you."
LocHelpText="Shield Wall now reduces incoming damage by <Ability:AEGIS_DAMAGE_REDUCTION/> and redirects any attacks against nearby allies towards you."
LocFlyOverText="Aegis"

[IRI_Rider_BackToBack X2AbilityTemplate]
LocFriendlyName="Back To Back"
LocLongDescription="If this soldier ends turn within <Ability:BACK_TO_BACK_RANGE_TILES/> tiles of an unimpaired allied soldier, enemies will not receive flanking bonuses to Aim and Crit against either of the soldiers during enemy turn."
LocHelpText="If this soldier ends turn within <Ability:BACK_TO_BACK_RANGE_TILES/> tiles of an unimpaired allied soldier, enemies will not receive flanking bonuses to Aim and Crit against either of the soldiers during enemy turn."
LocPromotionPopupText="<Bullet/>The effect is lost if one of the soldiers becomes impaired.<br/><Bullet/> 1 tile range means the soldiers must be on directly adjacent tiles. The effect will not be granted if they are on diagonal tiles."
LocFlyOverText="Back To Back"

[IRI_Rider_BackToBack_Passive X2AbilityTemplate]
LocFriendlyName="Back To Back"
LocLongDescription="If you end turn near an unimpaired allied soldier, enemies will not receive flanking bonuses to Aim and Crit against either of you during their turn."
LocHelpText="If you end turn near an unimpaired allied soldier, enemies will not receive flanking bonuses to Aim and Crit against either of you during their turn."
LocFlyOverText="Back To Back"

[IRI_Rider_Riposte X2AbilityTemplate]
LocFriendlyName="Riposte"
LocLongDescription="Use the primary weapon to counter enemy attacks that would Miss or Graze, or while <font color='#ff3206'>Guard</font> is active. Passively gain <Ability:RIPOSTE_BONUS_DODGE/> Dodge and resist most impairing effects applied by melee attack hits."
LocHelpText="Use the primary weapon to counter enemy attacks that would Miss or Graze, or while <font color='#ff3206'>Guard</font> is active. Passively gain <Ability:RIPOSTE_BONUS_DODGE/> Dodge and resist most impairing effects applied by melee attack hits."
LocPromotionPopupText="<Bullet/> Any attack performed at melee range can be countered, even if it is made with a ranged weapon.<br/><bullet/> Countering an attack allows to completely avoid it, and automatically respond with a counter attack.<br/><bullet/> An attack cannot be countered if the enemy is immune to reaction fire.<br/><bullet/> Counterattack counts as a reaction attack; it suffers aim penalties and normally cannot crit.<br/><bullet/> Counterattack deals damage only from the primary weapon, even if dual wielding, and it cannot activate <font color='#ff3206'>Cross Strike</font>.<br/><bullet/> Learning Riposte will make the soldier permanently immune to impairing effects of melee attacks performed by Stun Lancers, Mutons and Berserkers.<br/><bullet/> If <font color='#ff3206'>Guard</font> is active, its charge will be used to counter the enemy attack, if possible."
LocFlyOverText="Riposte!" 

[IRI_Rider_Riposte_Attack X2AbilityTemplate]
LocFriendlyName="Riposte"
LocLongDescription="Counter enemy attacks that would Miss or Graze, or while <font color='#ff3206'>Guard</font> is active. Passively gain <Ability:RIPOSTE_BONUS_DODGE/> Dodge and resist most impairing effects applied by melee attack hits."
LocHelpText="Counter enemy attacks that would Miss or Graze, or while <font color='#ff3206'>Guard</font> is active. Passively gain <Ability:RIPOSTE_BONUS_DODGE/> Dodge and resist most impairing effects applied by melee attack hits."
LocFlyOverText="Riposte!" 

[IRI_Rider_GalvanizedArmor X2AbilityTemplate]
LocFriendlyName="Galvanized Armor"
LocLongDescription="Gain <Ability:GALVANIZED_ARMOR_BONUS_ARMOR/> Armor. The last <Ability:GALVANIZED_ARMOR_UNSHREDDABLE_ARMOR/> Armor cannot be Shredded. Enemy Shred is reduced by <Ability:GALVANIZED_ARMOR_SHRED_RESIST/> against this unit."
LocHelpText="Gain <Ability:GALVANIZED_ARMOR_BONUS_ARMOR/> Armor. The last <Ability:GALVANIZED_ARMOR_UNSHREDDABLE_ARMOR/> Armor cannot be Shredded. Enemy Shred is reduced by <Ability:GALVANIZED_ARMOR_SHRED_RESIST/> against this unit."
LocFlyOverText="Galvanized Armor"

[IRI_Rider_MassIntercept X2AbilityTemplate]
LocFriendlyName="Rout"
LocLongDescription="Activate to <font color='#ff3206'>Intercept</font> all enemy movement within your line of sight and <Ability:ROUT_ACTION_POINT_DISTANCE/> AP move distance until the start of your next turn."
LocHelpText="<font color='#ff3206'>Intercept</font> all enemy movement within your line of sight and <Ability:ROUT_ACTION_POINT_DISTANCE/> AP move distance."
LocFriendlyNameWhenConcealed="Rout (Concealed)"
LocLongDescriptionWhenConcealed="<font color='#ff3206'>Intercept</font> all enemy movement within your line of sight and <Ability:ROUT_ACTION_POINT_DISTANCE/> AP move distance but only if revealed."
LocPromotionPopupText="<br/><Bullet/> Rout interception attacks are allowed to break concealment in order to attack the moving enemy: <Ability:ROUT_ALLOWED_TO_BREAK_CONCEALMENT/><br/><Bullet/> Activating Rout breaks unit's concealment: <Ability:ROUT_BREAKS_CONCEALMENT/><br/><Bullet/> After each Rout interception, the soldier will return to their original position: <Ability:ROUT_RETURN_TO_ORIGINAL_TILE/><br/><Bullet/> If the unit has <font color='#ff3206'>Guard</font>, one charge of Guard will be given for every Rout interception: <Ability:ROUT_GRANTS_GUARD/><br/><Bullet/> This ability benefits from <font color='#ff3206'>Ghost Rider</font>.<br/><Bullet/> <Ability:ROUT_COOLDOWN/> turn cooldown."
LocFlyOverText="Rout"

[IRI_Rider_MassIntercept_MarkTarget X2AbilityTemplate]
LocFriendlyName="Rout"
LocLongDescription="Intercept all enemies moving nearby."
LocHelpText="Intercept all enemies moving nearby."

[IRI_Rider_PoweredShields X2AbilityTemplate]
LocFriendlyName="Indomitable"
LocLongDescription="Armor can now reduce incoming damage to zero."
LocHelpText="Armor can now reduce incoming damage to zero."
LocFlyOverText="Indomitable"

;	=================================================
;				BREAKER TREE
;	=================================================

[IRI_Rider_ShadowWalk X2AbilityTemplate]
LocFriendlyName="Ghost Rider"
LocLongDescription="Become undetectable and gain <Ability:GHOST_RIDER_INTERCEPT_MOBILITY_BONUS/> Mobility bonus during <font color='#ff3206'>Interception</font>. Gain <Ability:GHOST_RIDER_REACTION_AIM_BONUS/> bonus Aim to all reaction attacks."
LocHelpText="Become undetectable and gain <Ability:GHOST_RIDER_INTERCEPT_MOBILITY_BONUS/> Mobility bonus during <font color='#ff3206'>Interception</font>. Gain <Ability:GHOST_RIDER_REACTION_AIM_BONUS/> bonus Aim to all reaction attacks."
LocPromotionPopupText="<Bullet/> This ability allows the soldier to avoid enemy reaction fire and otherwise draw unwanted attention from inactive enemies."
LocFlyOverText="Ghost Rider"

[IRI_Rider_Haymaker X2AbilityTemplate]
LocFriendlyName="Haymaker"
LocLongDescription="A mainhand melee attack that removes many positive effects from the enemy and deals critical electric damage."
LocHelpText="A mainhand melee attack that removes many positive effects from the enemy and deals critical electric damage."
LocFlyOverText="Haymaker"
LocPromotionPopupText="<Bullet/> <Ability:HAYMAKER_COOLDOWN/> turn cooldown.<br/><Bullet/> Haymaker always deals critical damage: <Ability:HAYMAKER_ALWAYS_CRITS/>. <br/><Bullet/> With default configuration, Haymaker will remove these positive effects from the target: ADVENT Shieldbearers' Energy Shield, Berserkers' Rage, Archons' Frenzy and ADVENT Priests' Holy Warrior. <br/><Bullet/> The effects are removed before the damage is applied."

[IRI_Rider_SunderArmor X2AbilityTemplate]
LocFriendlyName="Sunder Armor"
LocLongDescription="Your next <Ability:SUNDER_ARMOR_AFFECTS_NUMBER_OF_ATTACKS/> primary weapon attack(s) in the following <Ability:SUNDER_ARMOR_EFFECT_DURATION/> turn(s) will Shred armor instead of dealing damage. The amount of Shred is equal to <Ability:SUNDER_ARMOR_DAMAGE_TO_SHRED_PERCENT/> of the damage the attack would normally deal."
LocHelpText="Your next <Ability:SUNDER_ARMOR_AFFECTS_NUMBER_OF_ATTACKS/> primary weapon attack(s) in the following <Ability:SUNDER_ARMOR_EFFECT_DURATION/> turn(s) will Shred armor instead of dealing damage."
LocPromotionPopupText="<Bullet/> The attack can still Crit, shredding even more armor.<br/><Bullet/> Sunder Armor affects only primary weapon attacks: <Ability:SUNDER_ARMOR_APPLIES_ONLY_TO_SOURCE_WEAPON/>.<br/><Bullet/> Sunder Armor has no effect on abilities that ignore armor.<br/><Bullet/> <Ability:SUNDER_ARMOR_COOLDOWN/> turn cooldown. <br/><Bullet/> Sunder Armor effect lasts <Ability:SUNDER_ARMOR_EFFECT_DURATION/> turn(s), counting the turn it was activated on. <br/><Bullet/> Sunder Armor affects <Ability:SUNDER_ARMOR_AFFECTS_NUMBER_OF_ATTACKS/> attack(s). <br/><Bullet/> Activating Sunder Armor is a free action: <Ability:SUNDER_ARMOR_IS_FREE_ACTION/>"
LocFlyOverText="Sunder Armor" 

[IRI_Rider_Shockwave X2AbilityTemplate]
LocFriendlyName="Shockwave"
LocLongDescription="Stomp the ground, dealing electrical damage in a cone, bypassing armor, and disorienting with <Ability:SHOCKWAVE_DISORIENT_CHANCE/> chance and stunning for <Ability:SHOCKWAVE_STUN_ACTIONS/> actions with <Ability:SHOCKWAVE_STUN_CHANCE/> chance."
LocHelpText="Deal electrical damage that bypasses armor, as well as potentially disorient or stun targets in a cone."
LocFriendlyNameWhenConcealed="Shockwave (Break Concealment)"
LocLongDescriptionWhenConcealed="Break concealment to deal electrical damage that bypasses armor, as well as potentially disorient or stun targets in a cone."
LocPromotionPopupText="<Bullet/> <Ability:SHOCKWAVE_COOLDOWN/> turn cooldown, <Ability:SHOCKWAVE_CHARGES/> charges (0 means infinite uses).<br/><Bullet/> Shockwave deals <Ability:SHOCKWAVE_BASEDAMAGE_MIN/> - <Ability:SHOCKWAVE_BASEDAMAGE_MAX/> electrical damage that ignores armor and deals <Ability:SHOCKWAVE_ENVIRONMENTAL_DAMAGE/> damage to environment.<br/><Bullet/> Shockwave's area of effect is <Ability:SHOCKWAVE_CONE_LENGTH/> tiles long and <Ability:SHOCKWAVE_CONE_WIDTH/> tiles wide.<br/><Bullet/> This ability is affected by <font color='#ff3206'>Windcaller's Legacy</font> as if it was a melee attack."
LocFlyOverText="Shockwave"

[IRI_Rider_CircuitBreaker X2AbilityTemplate]
LocFriendlyName="Circuit Breaker"
LocLongDescription="Deal <Ability:CIRCUIT_BREAKER_BASEDAMAGE_MIN/> - <Ability:CIRCUIT_BREAKER_BASEDAMAGE_MAX/> electrical damage and shutdown target robotic unit for <Ability:CIRCUIT_BREAKER_STUN_DURATION_ACTIONS/> Actions."
LocHelpText="Deal <Ability:CIRCUIT_BREAKER_BASEDAMAGE_MIN/> - <Ability:CIRCUIT_BREAKER_BASEDAMAGE_MAX/> electrical damage and shutdown target robotic unit for <Ability:CIRCUIT_BREAKER_STUN_DURATION_ACTIONS/> Actions."
LocFriendlyNameWhenConcealed="Circuit Breaker (Break Concealment)"
LocLongDescriptionWhenConcealed="Break concealment to deal <Ability:CIRCUIT_BREAKER_BASEDAMAGE_MIN/> - <Ability:CIRCUIT_BREAKER_BASEDAMAGE_MAX/> electrical damage and shutdown target robotic unit for <Ability:CIRCUIT_BREAKER_STUN_DURATION_ACTIONS/> Actions."
LocPromotionPopupText="<Bullet/> <Ability:CIRCUIT_BREAKER_COOLDOWN/> turn cooldown, <Ability:CIRCUIT_BREAKER_CHARGES/> charges (0 means infinite uses).<br/><Bullet/> Deals <Ability:CIRCUIT_BREAKER_BASEDAMAGE_MIN/> - <Ability:CIRCUIT_BREAKER_BASEDAMAGE_MAX/> electrical damage that ignores armor.<br/><Bullet/> Circuit Breaker ends soldier's turn: <Ability:CIRCUIT_BREAKER_ENDS_TURN/><br/><Bullet/> Circuit Breaker has <Ability:CIRCUIT_BREAKER_BONUS_AIM/> Bonus Aim.<br/><Bullet/> Circuit Breaker always hits: <Ability:CIRCUIT_BREAKER_GUARANTEED_HIT/>"
LocFlyOverText="Circuit Breaker"

[IRI_Rider_Thunderdome X2AbilityTemplate]
LocFriendlyName="Thunderdome"
LocLongDescription="Mark an area with a <Ability:THUNDERDOME_RADIUS_TILES/> Tile radius. Until the end of turn, killing enemies in that area refunds Action Points for you and your squadmembers."
LocHelpText="Mark an area. Until the end of turn, killing enemies in that area refunds Action Points."
LocPromotionPopupText="<Bullet/> Both the attacking soldier and the enemy unit need to be inside the Thunderdome in order to receive the Action Point refund. <br/><Bullet/> Allies can benefit from Action Point refund only once: <Ability:THUNDERDOME_AFFECTS_ALLIES_ONCE/><br/><Bullet/> <Ability:THUNDERDOME_CAST_RANGE_TILES/> Tile cast range.<br/><Bullet/> <Ability:THUNDERDOME_COOLDOWN/> Turn cooldown."
LocFlyOverText="Thunderdome" 

[IRI_Rider_Thunderdome_Followup X2AbilityTemplate]
LocFriendlyName="Thunderdome"
LocLongDescription="Mark an area with a <Ability:THUNDERDOME_RADIUS_TILES/> Tile radius. Until the end of turn, killing enemies in that area refunds Action Points for you and your squadmembers."
LocHelpText="Mark an area. Until the end of turn, killing enemies in that area refunds Action Points."
LocFlyOverText="Thunderdome" 

[IRI_Rider_RollingThunder X2AbilityTemplate]
LocFriendlyName="Rolling Thunder"
LocLongDescription="Whenever you deal Electrical damage, detect enemy presence in a <Ability:ROLLING_THUNDER_REVAIL_RADIUS_TILES/> tile radius. <Ability:ROLLING_THUNDER_COOLDOWN/> turn cooldown."
LocHelpText="Whenever you deal Electrical damage, detect enemy presence in a <Ability:ROLLING_THUNDER_REVAIL_RADIUS_TILES/> tile radius. <Ability:ROLLING_THUNDER_COOLDOWN/> turn cooldown."
LocFlyOverText="Rolling Thunder" 

[IRI_Rider_RollingThunder_Passive X2AbilityTemplate]
LocFriendlyName="Rolling Thunder"
LocLongDescription="Whenever you deal Electrical damage, detect enemy presence in a <Ability:ROLLING_THUNDER_REVAIL_RADIUS_TILES/> tile radius. <Ability:ROLLING_THUNDER_COOLDOWN/> turn cooldown."
LocHelpText="Whenever you deal Electrical damage, detect enemy presence in a <Ability:ROLLING_THUNDER_REVAIL_RADIUS_TILES/> tile radius. <Ability:ROLLING_THUNDER_COOLDOWN/> turn cooldown."
LocFlyOverText="Rolling Thunder" 

;	=================================================
;				GTS UNLOCKS
;	=================================================

[IRI_Rider_GTS_BerserkerRage X2SoldierAbilityUnlockTemplate]
DisplayName="Stormrider: Eye of the Storm"
Summary="Stormriders gain the ability to remove any mental impairments at turn start, and become Enraged. This effect has a <Ability:BERSERKER_RAGE_COOLDOWN/> turn cooldown and doesn't work while mindcontrolled. To unlock this perk a Stormrider on your crew must master all of the Berserker abilities."

[IRI_Rider_GTS_MartialArts X2SoldierAbilityUnlockTemplate]
DisplayName="Stormrider: Martial Arts"
Summary="Stormriders' melee attacks deal <Ability:MARTIAL_ARTS_BONUS_DAMAGE/> damage to humanoid enemies. Same bonus is granted to melee attacks that do not require a melee weapon, such as <font color='#ff3206'>Blitz Kick</font>. To unlock this perk a Stormrider on your crew must master all of the Charger abilities."

[IRI_Rider_GTS_PoweredShields X2SoldierAbilityUnlockTemplate]
DisplayName="Stormrider: Indomitable"
Summary="Stormriders' Armor can now reduce incoming damage to zero. To unlock this perk a Stormrider on your crew must master all of the Stalwart abilities."

[IRI_Rider_GTS_RollingThunder X2SoldierAbilityUnlockTemplate]
DisplayName="Stormrider: Rolling Thunder"
Summary="Stormriders gain the ability to detect nearby enemy presence whenever they deal electrical damage. To unlock this perk a Stormrider on your crew must master all of the Breaker abilities."



